# Lookup Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SharedParameterElement..::..Lookup Method
SharedParameterElement Class See Also
---
Finds the shared parameter element that corresponds to the given Guid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static SharedParameterElement Lookup(
	Document document,
	Guid guidValue
)
```

Visual Basic
---
```text
Public Shared Function Lookup ( _
	document As Document, _
	guidValue As Guid _
) As SharedParameterElement
```

Visual C++
---
```text
public:
static SharedParameterElement^ Lookup(
	Document^ document,
	Guid guidValue
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
guidValue
    Type: System..::..Guid Shared parameter Guid.
# ### Return Value
The retrieved shared parameter instance, or nullNothingnullptra null reference (Nothing in Visual Basic) if the matching element is not found.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SharedParameterElement Class
Autodesk.Revit.DB Namespace